

	/* -------------------------------------------------- */
	// Variable
	/* -------------------------------------------------- */


	/* -------------------------------------------------- */
	// Selector
	/* -------------------------------------------------- */

	var selColorName;

	/* -------------------------------------------------- */
	// Event
	/* -------------------------------------------------- */

	$(window).load(function(){
		measureWindowSize(); //ウィンドウサイズの計測
		setSelector(); //使用するセレクタの指定
		animation(); //アニメーション

		//イベント関連

	}); //load

	$(window).resize(function(){

		measureWindowSize(); //ウィンドウサイズの計測

	}); //resize


	/* -------------------------------------------------- */
	// Function 計測系
	/* -------------------------------------------------- */

	//ウィンドウサイズの計測
	function measureWindowSize() {
		windowWidth = $(window).width();
		windowHeight = $(window).height();
	} //function


	/* -------------------------------------------------- */
	// Function 要素追加　セレクタ定義
	/* -------------------------------------------------- */

	//使用するセレクタの指定
	function setSelector() {
		selColorName = $('#color_name');
	} //function

	/* -------------------------------------------------- */
	// Function
	/* -------------------------------------------------- */


	function animation() {

		//色名の表示
		setTimeout(function(){
			selColorName.addClass('time1');
		}, 0);

		setTimeout(function(){
			selColorName.addClass('time2');
		}, 1200);

		setTimeout(function(){
			selColorName.addClass('time3');
		}, 3000);



	} //function


	/* -------------------------------------------------- */


	/* -------------------------------------------------- */


	/* -------------------------------------------------- */



	/* -------------------------------------------------- */



	/* -------------------------------------------------- */











	/* -------------------------------------------------- */
	// Function (event)
	/* -------------------------------------------------- */




	/* ---------- */

